In [1]:
### 작업환경 설정하기

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
### 결측치 처리하기

data = pd.Series(['apple', 'banana', np.nan, 'mango'])
data

0     apple
1    banana
2       NaN
3     mango
dtype: object

In [6]:
data.dropna()

0     apple
1    banana
3     mango
dtype: object

###  불리언 색인을 통해서 직접 계산하는것도 가능

In [7]:
data[data.notnull()]

0     apple
1    banana
3     mango
dtype: object

In [ ]:
#dataframe 의 경우 모두 na 인 행이나 컬럼을 제외하던가
#하나라도 na 값을 포함하고 있는 행이나 컬럼을 제외할수 도 있음
# dropna() : na값이 하나라도 있는 행은 제외

In [36]:
data = pd.DataFrame([[1, 6.5, 3],[1, np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3]])
data.dropna(how = 'all')
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data[3] = np.nan
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  0.0  0.0 NaN
2  0.0  0.0  0.0 NaN
3  0.0  6.5  3.0 NaN

In [30]:
data = data.dropna(axis = 1, how = "all")
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [35]:
### 누락된값 채우기

data = data.fillna(0)
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

In [38]:
data.fillna({1:0.5, 2:1})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.5  1.0
2  NaN  0.5  1.0
3  NaN  6.5  3.0

In [39]:
data.fillna(data.mean())

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0